In [1]:
import pandas as pd

In [2]:
obj=pd.Series([4,-5,7,3])
print(obj)

0    4
1   -5
2    7
3    3
dtype: int64

In [3]:
sales=pd.Series([100,200,300,100,400])
print(sales.values,"\n")
print(sales.index,"\n")
print(sales)

[100 200 300 100 400]

RangeIndex(start=0, stop=5, step=1)

0    100
1    200
2    300
3    100
4    400
dtype: int64

In [4]:
sales=pd.Series([100,200,300,100,400],index=['a','b','c','d','e'])
print(sales)

a    100
b    200
c    300
d    100
e    400
dtype: int64

**create a canteen one week sale report in pandas series**

In [5]:
sales_report=pd.Series([10,34,23,21,34,56,43],index=['mon','tue','wed','thu','fri','sat','sun'],name="sale report")
print(sales_report)

mon    10
tue    34
wed    23
thu    21
fri    34
sat    56
sun    43
Name: sale report, dtype: int64

In [6]:
print(sales_report[1])
print(sales_report['sat'])

34
56

In [7]:
print(sales_report[['sat','mon','wed']])

sat    56
mon    10
wed    23
Name: sale report, dtype: int64

In [8]:
print(sales_report[[4,6,2]])

fri    34
sun    43
wed    23
Name: sale report, dtype: int64

In [9]:
print(sales_report[sales_report>30])

tue    34
fri    34
sat    56
sun    43
Name: sale report, dtype: int64

In [10]:
print('mon' in sales_report)

True

In [11]:
print(['mon' in sales_report])

[True]

In [12]:
sales_report['mon']

10

In [13]:
import numpy as np

In [14]:
data= np.arange(5)
ind=['a','b','c','d','e']
n1='Practice '
series1= pd.Series(data,index=ind,name=n1)
print(series1)

a    0
b    1
c    2
d    3
e    4
Name: Practice , dtype: int32

In [15]:
stats_name={'punjab':3000,'Sindh':4000,'Kpk':456,'Balouchistan':8000}
stats_1=pd.Series(stats_name,name="stats name")
print(stats_1)

punjab          3000
Sindh           4000
Kpk              456
Balouchistan    8000
Name: stats name, dtype: int64

In [16]:
stats_name={'punjab':3000,'Sindh':4000,'Kpk':456,'Balouchistan':8000}
stats_1=pd.Series(stats_name,name="stats name",index=['Sindh','Kpk','Gb','punjab','Balouchistan'])
print(stats_1)

Sindh           4000.0
Kpk              456.0
Gb                 NaN
punjab          3000.0
Balouchistan    8000.0
Name: stats name, dtype: float64

In [17]:
print(pd.isnull(stats_1),'\n')

stats_1.isnull()

Sindh           False
Kpk             False
Gb               True
punjab          False
Balouchistan    False
Name: stats name, dtype: bool

Sindh           False
Kpk             False
Gb               True
punjab          False
Balouchistan    False
Name: stats name, dtype: bool

In [18]:
stats_1.name="tax paying units"
stats_1.index.name="tax state"
print(stats_1)

tax state
Sindh           4000.0
Kpk              456.0
Gb                 NaN
punjab          3000.0
Balouchistan    8000.0
Name: tax paying units, dtype: float64

In [19]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
'year': [2000, 2001, 2002, 2001, 2002, 2003],
'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame = pd.DataFrame(data)

In [20]:
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [21]:
frame.head(2)

  state  year  pop
0  Ohio  2000  1.5
1  Ohio  2001  1.7

In [22]:
frame.tail(2)

    state  year  pop
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [23]:
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [24]:
pd.DataFrame(data, columns=['year', 'state', 'pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [25]:
frame2=pd.DataFrame(data, columns=['year', 'state', 'pop','debt'],index=['one','two','three','four','five','six'])

In [26]:
pd.isnull(frame2)

        year  state    pop  debt
one    False  False  False  True
two    False  False  False  True
three  False  False  False  True
four   False  False  False  True
five   False  False  False  True
six    False  False  False  True

In [27]:
frame2["state"]

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object

In [28]:
frame2["year"]

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64

In [29]:
frame2["debt"]=19.6

In [30]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  19.6
two    2001    Ohio  1.7  19.6
three  2002    Ohio  3.6  19.6
four   2001  Nevada  2.4  19.6
five   2002  Nevada  2.9  19.6
six    2003  Nevada  3.2  19.6

In [31]:
val = pd.Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five'])
frame2['debt']=val

In [32]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [33]:
frame2['debt'] = np.arange(6.)

In [34]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0
six    2003  Nevada  3.2   5.0

In [35]:
frame2['eastern'] = 'Ohio'

In [36]:
frame2

       year   state  pop  debt eastern
one    2000    Ohio  1.5   0.0    Ohio
two    2001    Ohio  1.7   1.0    Ohio
three  2002    Ohio  3.6   2.0    Ohio
four   2001  Nevada  2.4   3.0    Ohio
five   2002  Nevada  2.9   4.0    Ohio
six    2003  Nevada  3.2   5.0    Ohio

In [37]:
del frame2['eastern']

In [38]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0
six    2003  Nevada  3.2   5.0

In [39]:
frame2.T

        one   two three    four    five     six
year   2000  2001  2002    2001    2002    2003
state  Ohio  Ohio  Ohio  Nevada  Nevada  Nevada
pop     1.5   1.7   3.6     2.4     2.9     3.2
debt      0     1     2       3       4       5

In [40]:
obj = pd.Series(range(3), index=['a', 'b', 'c'])
index = obj.index
print(index,'\n')
print(index[1:])

Index(['a', 'b', 'c'], dtype='object')

Index(['b', 'c'], dtype='object')

In [41]:
labels = pd.Index(np.arange(3))
labels

Int64Index([0, 1, 2], dtype='int64')

In [42]:
obj2 = pd.Series([1.5, -2.5, 0], index=labels)
obj2

0    1.5
1   -2.5
2    0.0
dtype: float64

In [43]:
labels is obj2

False

In [44]:
obj2.index is labels

True

In [45]:
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])

In [46]:
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [47]:
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'])

In [48]:
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [49]:
obj3 = pd.Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])

In [50]:
obj3

0      blue
2    purple
4    yellow
dtype: object

In [51]:
obj3.reindex(range(6), method='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [52]:
obj3.reindex(range(12),method='ffill')

0       blue
1       blue
2     purple
3     purple
4     yellow
5     yellow
6     yellow
7     yellow
8     yellow
9     yellow
10    yellow
11    yellow
dtype: object

In [53]:
frame = pd.DataFrame(np.arange(9).reshape((3, 3)),
                     index=['a', 'c', 'd'],
                     columns=['Ohio', 'Texas', 'California'])
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [54]:
frame2 = frame.reindex(['a', 'b', 'c', 'd'])

In [55]:
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [56]:
states = ['Texas', 'Utah', 'California']

In [57]:
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [60]:
frame.loc[['a', 'b', 'c', 'd'], states]

KeyError: 'Passing list-likes to .loc or [] with any missing labels is no longer supported, see https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#deprecate-loc-reindex-listlike'

In [61]:
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [65]:
frame2.isnull=fill_value=0

In [66]:
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [67]:
obj = pd.Series(np.arange(5.), index=['a', 'b', 'c', 'd', 'e'])

In [68]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [70]:
obj.drop('c')

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [71]:
frame.fill_value=0

In [73]:
frame['texas']=np.nan

In [74]:
frame

   Ohio  Texas  California  texas
a     0      1           2    NaN
c     3      4           5    NaN
d     6      7           8    NaN

In [81]:
frame.loc['a',['texas']]

texas   NaN
Name: a, dtype: float64

In [76]:
frame

   Ohio  Texas  California  texas
a     0      1           2    NaN
c     3      4           5    NaN
d     6      7           8    NaN

In [86]:
frame.iloc[[0,2]]

   Ohio  Texas  California  texas
a     0      1           2    NaN
d     6      7           8    NaN

In [87]:
frame

   Ohio  Texas  California  texas
a     0      1           2    NaN
c     3      4           5    NaN
d     6      7           8    NaN

In [92]:
frame['texas']=(fill_value)

In [93]:
frame

   Ohio  Texas  California  texas
a     0      1           2      0
c     3      4           5      0
d     6      7           8      0